FROM golang:1.22.2

#указываем рабочий каталог
WORKDIR /parcel

#загружает все модули и пакеты, указанные в go.mod и go.sum
COPY go.mod go.sum ./

#Команда RUN запускает команды так, как будто вы делаете это в вашем терминале, только эти команды запускаются в Docker-образе.
RUN go mod download

#Далее нужно скопировать ваш исходный код в Docker-образ
COPY . .

#чтобы скомпилировать ваше приложение, используйте знакомую команду RUN
RUN CGO_ENABLED=0 GOOS=linux GOARCH=amd64 go build -o /my_parcel

#Теперь осталось сообщить, какую команду запускать, когда ваш Docker-образ используется для запуска контейнера.
CMD ["/my_parcel"]
